app/controllers/pages_controller.rb

  def show
    @page = Page.find_by_name(params[:name])
---
SELECT * FROM "pages" WHERE ("pages"."name" IS NULL) LIMIT 1

  def edit
    @page = Page.find_by_name(params[:name])
---
SELECT * FROM "pages" WHERE ("pages"."name" = 'FirstPage') LIMIT 1

  def create
    @page = Page.new(params[:page])

    respond_to do |format|
      if @page.save
---
INSERT INTO "pages" ("name", "created_at", "updated_at", "internal") VALUES('FirstPage', '2009-07-14 17:29:17', '2009-07-14 17:29:17', 'f')

  def update
  	if params[:id]
	    @page = Page.find(params[:id])
	  else
	  	@page = Page.create!(params[:page])
	  end

    respond_to do |format|
      if @page.update_attributes(params[:page])
---
SELECT * FROM "pages" WHERE ("pages"."id" = 0)
INSERT INTO "pages" ("name", "created_at", "updated_at", "internal") VALUES('SecondPage', '2009-07-14 19:06:16', '2009-07-14 19:06:16', 'f')
UPDATE "pages" SET "updated_at" = '2009-07-14 17:58:53', "name" = 'FirstPage1' WHERE "id" = 2

  def destroy
    @page = Page.find_by_name(params[:name])
    @page.destroy
---
SELECT * FROM "pages" WHERE ("pages"."name" = 'FirstPage') LIMIT 1
DELETE FROM "pages" WHERE "id" = 1